<br><br><right><h1 style="font-size:4em;color:#2467C0">DAY 8 - STUDENT PERFORMANCE ANALYSIS USING THE STUDENT PERFORMANCE DATASET</h1></right>
<br>
<table>
<col width="550">
<col width="450">
<tr>
This dataset contains information about the performance of students.

In [26]:
import pandas as pd

In [29]:
df = pd.read_csv(r"C:\Users\seyi\Desktop\MY DATA SCIENCE WORKS, TUTORIAL AND JOURNEY\100 days of DS\Resources\StudentsPerformance.csv")

In [30]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

 # Data Cleaning

In [31]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [34]:
df.shape

(1000, 8)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
gender                         1000 non-null object
race/ethnicity                 1000 non-null object
parental level of education    1000 non-null object
lunch                          1000 non-null object
test preparation course        1000 non-null object
math score                     1000 non-null int64
reading score                  1000 non-null int64
writing score                  1000 non-null int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [35]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [38]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [40]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [41]:
df['race/ethnicity'].value_counts()

group C    319
group D    262
group B    190
group E    140
group A     89
Name: race/ethnicity, dtype: int64

# What is the probability of students scoring more than 50 in the various subjects

In [44]:
t_stud = df.shape[0]
t_stud

1000

In [47]:
# Checking the students that have more than 50 mks in maths
maths_score = df[df['math score'] > 50].shape[0]
maths_score

850

In [73]:
# Prob of the students scoring more than 50 in Maths 
prob_maths = (maths_score/t_stud)*100
print('The Probability of Student Scoring More Than 50 in Maths is', prob_maths)

The Probability of Student Scoring More Than 50 in Maths is 85.0

In [53]:
# Checking the students that have more than 50 mks in reading
read_score = df[df['reading score'] > 50].shape[0]
read_score

903

In [55]:
# Prob of the students scoring more than 50 in Reading
prob_read = (read_score/t_stud)*100
print('The Probability of Student Scoring More Than 50 in Reading is', prob_read)

The Probability of Student Scoring More Than 50 in Reading is 90.3

In [56]:
# Checking the students that have more than 50 mks in Writing
write_score = df[df['writing score'] > 50].shape[0]
write_score

876

In [57]:
# Prob of the students scoring more than 50 in Writing
prob_write = (write_score/t_stud)*100
print('The Probability of Student Scoring More Than 50 in Writing is', prob_write)

The Probability of Student Scoring More Than 50 in Writing is 87.6

# What is the probability that the student would pass all three subjects

In [63]:
number_of_students_passing_in_all_subjects = data[(data['math score'] > 40) &
                                                  (data['writing score'] > 40) & 
                                                  (data['reading score'] > 40)].shape[0]
probability_of_students_passing_in_all_the_subjects = (number_of_students_passing_in_all_subjects/t_stud)*100

In [72]:
# Prob of the students passing all the 3 subjects
print('The Probability of the Students Passing All Three Subjects is {0:.2f} %'.format(probability_of_students_passing_in_all_the_subjects))

The Probability of the Students Passing All Three Subjects is 93.90 %

# Comparing the Performance of Girls and Boys in the various subjects

In [74]:
df.groupby(['gender']).agg(['min', 'median', 'max'])

       math score             reading score             writing score         \
              min median  max           min median  max           min median
gender
female          0     65  100            17     73  100            10     74
male           27     69  100            23     66  100            15     64


        max
gender
female  100
male    100

> Observation: 
1. Math Score: Male students did better than the female students
2. Reading Score: Male students performed better than the female students
3. Writing Score: Male students also did better here

But can we conclude that the Male students did better than the female students. Looking at the value counts, the female students were more than the male students

# Effect of lunch on the Student Performance in the various subjects

In [78]:
df[['lunch','gender','math score','writing score','reading score']].groupby(['lunch','gender']).agg('median')

                     math score  writing score  reading score
lunch        gender
free/reduced female        57.0           68.0           67.0
             male          62.0           59.0           61.0
standard     female        67.0           76.0           75.0
             male          72.0           67.0           67.5

# Effect of Race/Ethnicity on the Student Performance in the various subjects

In [79]:
df[['race/ethnicity',
      'math score',
      'writing score',
      'reading score']].groupby(['race/ethnicity']).agg('median')

                math score  writing score  reading score
race/ethnicity
group A               61.0           62.0           64.0
group B               63.0           67.0           67.0
group C               65.0           68.0           71.0
group D               69.0           72.0           71.0
group E               74.5           72.0           74.0

# Effect of Test Preparation Courses on the Student Performance in the various subjects

In [80]:
df[['test preparation course',
      'gender',
      'math score',
      'writing score',
      'reading score']].groupby(['test preparation course','gender']).agg('median')

                                math score  writing score  reading score
test preparation course gender
completed               female          67             79             78
                        male            73             70             71
none                    female          62             70             71
                        male            67             60             63

# Splitting the scores into Grades

In [93]:
# Assigning grades to the grades according to the following criteria :
# 0  - 40 marks : grade E
# 41 - 60 marks : grade D
# 60 - 70 marks : grade C
# 70 - 80 marks : grade B
# 80 - 90 marks : grade A
# 90 - 100 marks : grade O

def getgrade(percentage, status):
    if status == 'Fail':
        return 'E'
    if(percentage >= 90):
        return 'O'
    if(percentage >= 80):
        return 'A'
    if(percentage >= 70):
        return 'B'
    if(percentage >= 60):
        return 'C'
    if(percentage >= 40):
        return 'D'
    else :
        return 'E'

# Showing the Parental level of Education

In [96]:
df['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [98]:
par = df[['parental level of education', 'race/ethnicity']].groupby(['parental level of education'])

In [100]:
par.head()

   parental level of education race/ethnicity
0            bachelor's degree        group B
1                 some college        group C
2              master's degree        group B
3           associate's degree        group A
4                 some college        group C
5           associate's degree        group B
6                 some college        group B
7                 some college        group B
8                  high school        group D
9                  high school        group B
10          associate's degree        group C
11          associate's degree        group D
12                 high school        group B
13                some college        group A
14             master's degree        group A
15            some high school        group C
16                 high school        group C
17            some high school        group B
18             master's degree        group C
19          associate's degree        group C
20                 high school        group D
23            some high school        group C
24           bachelor's degree        group D
25             master's degree        group A
27           bachelor's degree        group C
29             master's degree        group D
37            some high school        group D
54            some high school        group C
60           bachelor's degree        group E
77           bachelor's degree        group A